src/DataProcessors/ТестКопияДанныхФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ТестКопияДанныхФормы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ТестКопияДанныхФормы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РеквизитОбъектаПриИзменении(Элемент)
	Если РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыСравнить(ЭтотОбъект, "Объект." + Элемент.Имя) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Значение не изменилось'"));
		Возврат;
	КонецЕсли;
	
	ЗначениеДо = РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыПолучить(ЭтотОбъект, "Объект." + Элемент.Имя);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Предыдущее значение: '") + Строка(ЗначениеДо));
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновитьРеквизиты(ЭтотОбъект, "Объект." + Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	НомерЭлемента	= СтрЗаменить(Элемент.Имя, "Реквизит", "");
	ИмяЭлемента		= "Реквизит" + Формат(Число(НомерЭлемента) - 5, "ЧГ=");
	
	Если РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыСравнить(ЭтотОбъект, ИмяЭлемента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Значение не изменилось'"));
		Возврат;
	КонецЕсли;
	
	ЗначениеДо = РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыПолучить(ЭтотОбъект, ИмяЭлемента);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Предыдущее значение: '") + Строка(ЗначениеДо));
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновитьРеквизиты(ЭтотОбъект, "РеквизитыФормы");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Новый Массив;
	Для Каждого МетаРеквизит Из Метаданные.Обработки.ТестКопияДанныхФормы.Реквизиты Цикл
		РеквизитыОбъекта.Добавить("Объект." + МетаРеквизит.Имя);
	КонецЦикла;
	
	РаботаСФормамиПТБ.КопияДанныхФормыИнициализация(ЭтотОбъект, РеквизитыОбъекта);
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновить(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизитыФормы(Команда)
	
	Массив = СтрРазделить("Реквизит1,Реквизит2,Реквизит3,Реквизит4,Реквизит5", ",");
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыДобавитьРеквизиты(ЭтотОбъект, Массив, "РеквизитыФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновить(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуПоОбъекту(Команда)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.Объект);
	РаботаСФормамиПТБКлиентСервер.КопияДанныхФормыОбновитьРеквизиты(ЭтотОбъект, "РеквизитыФормы");
КонецПроцедуры
